uhnp/src/Catalogs/ТипыБазДанных/ТипыБазДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыБазДанных</name>
  <predefined>
    <items>
      <name>ТекущаяИБ</name>
      <description>Текущая информационная база</description>
    </items>
    <items>
      <name>ОбменТаблДок</name>
      <description>Файлы Microsoft Excel</description>
    </items>
  </predefined>
  <attributes>
    <name>ВИБПоУмолчанию</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>EnumRef.ПлатформыВнешнихИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПоУмолчанию</name>
    <comment>Если при сопоставлении получено пустое значение валюты, тогда подставить значение валюты по умолчанию</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменДаннымиРегламентнымЗаданием</name>
    <comment>Выполнять данными контроля НСИ регламентным заданием</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьНСИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуютсяПланыОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеВидовСубконто</name>
    <attributes>
      <name>ВидСубконтоИБ</name>
      <type>
        <types>ChartOfCharacteristicTypesRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидАналитики</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Enums/ПлатформыВнешнихИнформационныхБаз/ПлатформыВнешнихИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПлатформыВнешнихИнформационныхБаз</name>
  <enumValues>
    <name>Предприятие8</name>
  </enumValues>
  <enumValues>
    <name>Предприятие81</name>
  </enumValues>
  <enumValues>
    <name>Предприятие77</name>
  </enumValues>
  <enumValues>
    <name>Предприятие82</name>
  </enumValues>
  <enumValues>
    <name>Предприятие83</name>
  </enumValues>
  <enumValues>
    <name>ADO</name>
    <comment>Работа с внешними информационными базами через ADO</comment>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ТипыБазДанных/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ЗагрузитьСтруктуруМетаданныхСервер()
	
	Если Объект.ВерсияПлатформы = Перечисления.ПлатформыВнешнихИнформационныхБаз.ADO Тогда
		
		Справочники.ТаблицыADO.ОбновитьТаблицыADO(Объект.Ссылка);
				
	Иначе 
		
		Кэш = РаботаСОбъектамиМетаданныхУХ.НовыйКэшОбновленияМетаданных();
		
		РаботаСОбъектамиМетаданныхУХ.ЗаполнитьСписокПеречисленийБД(Объект.Ссылка,, Кэш);
		РаботаСОбъектамиМетаданныхУХ.ЗаполнитьСписокСправочниковБД(Объект.Ссылка,, Кэш);
		РаботаСОбъектамиМетаданныхУХ.ЗаполнитьСписокДокументовБД(Объект.Ссылка,, Кэш);
		
		Если НЕ Объект.ВерсияПлатформы = Перечисления.ПлатформыВнешнихИнформационныхБаз.Предприятие77 Тогда
			
			РаботаСОбъектамиМетаданныхУХ.ЗаполнитьСписокПлановВидовХарактеристикБД(Объект.Ссылка,,Кэш);
			
		КонецЕсли;
			
		
		РаботаСОбъектамиМетаданныхУХ.ЗаполнитьСписокРегистровБД(Объект.Ссылка,, 
			Истина, 
			Истина,
			НЕ Объект.ВерсияПлатформы=Перечисления.ПлатформыВнешнихИнформационныхБаз.Предприятие77,
			Истина,
			Истина, 
			Кэш);
			
		Если Объект.ИспользуютсяПланыОбмена Тогда
			
			Справочники.ТипыБазДанных.СоздатьНастройкиСоответствияПоGUID(Объект.Ссылка);
			
		КонецЕсли;
		
		УстановитьВидимость();
			
	КонецЕсли;
			
КонецПроцедуры // ЗаполнитьСписокРегистров() 

&НаКлиенте
Процедура ЗагрузитьСтруктуруМетаданных(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ТекстВопроса = НСтр("ru = 'Тип ИБ еще не записан.
			|Загрузка структуры метаданных возможна только после записи.
			|Данные будут записаны.'");
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьСтруктуруМетаданныхПродолжение", ЭтотОбъект);
			
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена,,КодВозвратаДиалога.Отмена);
		Возврат;
	КонецЕсли;
	
	ЗагрузитьСтруктуруМетаданныхСервер();
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСтруктуруМетаданныхПродолжение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Записать() Тогда 
		ЗагрузитьСтруктуруМетаданныхСервер();	
	Иначе
		ПоказатьПредупреждение(,Нстр("ru = 'При записи типа ИБ произошла ошибка'"));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ОбменДаннымиКонтроляНСИ=?(Объект.ОбменДаннымиРегламентнымЗаданием,1,0);
	
	УстановитьВидимость();
	УстановитьДоступность();
	
КонецПроцедуры 

&НаСервере
Функция ЕстьОбъектыКонтроляНСИ()
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Возврат Ложь;
		
	КонецЕсли; 
		
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	СправочникиБД.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СправочникиБД КАК СправочникиБД
	|ГДЕ
	|	СправочникиБД.Наименование = &ИмяСправочника
	|	И НЕ СправочникиБД.ОтсутствуетВКонфигурации
	|	И НЕ СправочникиБД.ПометкаУдаления
	|	И СправочникиБД.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("ИмяСправочника","СправочникиБД");
	Запрос.УстановитьПараметр("Владелец",Объект.Ссылка);
	
	Результат=Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
		
КонецФункции // ЕстьОбъектыКонтроляНСИ() 


&НаСервере
Процедура УстановитьДоступность()
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	СправочникиБД.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СправочникиБД КАК СправочникиБД
	|ГДЕ
	|	СправочникиБД.ЦентрализованнаяБазаНСИ.ТипБД = &ТипБД";
	
	Запрос.УстановитьПараметр("ТипБД",Объект.Ссылка);
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		
		Элементы.ДекорацияНСИ.Видимость=Истина;
		ЭтотОбъект.ТолькоПросмотр=Истина;
		Элементы.ГруппаКонтрольНСИ.Видимость=Ложь;
		
	КонецЕсли;	
	
КонецПроцедуры // 

&НаКлиенте
Процедура НастроитьСоответствия(Команда)
	
	Если НЕ Объект.Предопределенный Тогда
		
		ОткрытьФорму("Справочник.СоответствиеВнешнимИБ.ФормаСписка", Новый Структура("Отбор", Новый Структура("Владелец", Объект.Ссылка)));
		
	ИначеЕсли Объект.Ссылка = ПредопределенноеЗначение("Справочник.ТипыБазДанных.ТекущаяИБ") Тогда
		
		// Откроем форму настройки сооответствия видов субконто
		
	Иначе
		
		ОткрытьФорму("Справочник.ТипыБазДанных.Форма.НастройкаПолейДляВидаАналитик");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменДаннымиКонтроляНСИПриИзменении(Элемент)
	
	Объект.ОбменДаннымиРегламентнымЗаданием=(ОбменДаннымиКонтроляНСИ=1);
	
КонецПроцедуры

&НаСервере
Процедура ВерсияПлатформыПриИзмененииНаСервере()
	
	УстановитьВидимость();
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьВидимость()
	
	Элементы.ГруппаНастройкиПодключения.Видимость = НЕ Объект.Предопределенный;
	Элементы.Наименование.Доступность = НЕ Объект.Предопределенный; 
	
	Элементы.ГруппаКонтрольНСИ.Видимость=(Не Объект.Предопределенный) 
		И Константы.ЭтоЦентрализованнаяБазаНСИ.Получить()
		И Объект.ВерсияПлатформы=Перечисления.ПлатформыВнешнихИнформационныхБаз.Предприятие83
		И ЕстьОбъектыКонтроляНСИ();
		
	Элементы.ИспользуютсяПланыОбмена.Видимость=(Не Объект.Предопределенный) И Объект.ВерсияПлатформы=Перечисления.ПлатформыВнешнихИнформационныхБаз.Предприятие83;

КонецПроцедуры // УстановитьВидимость() 

&НаКлиенте
Процедура ВерсияПлатформыПриИзменении(Элемент)
	ВерсияПлатформыПриИзмененииНаСервере();
КонецПроцедуры
